["In a fight between Batman and Darth Vader, the winner would be Chuck Norris.","&quot;Brokeback Mountain&quot; is not just a movie. It's also what Chuck Norris calls the pile of dead ninjas in his front yard.","Chuck Norris's version of a &quot;chocolate milkshake&quot; is a raw porterhouse wrapped around ten Hershey bars, and doused in diesel fuel.","Chuck Norris can judge a book by its cover.","Chuck Norris plays racquetball with a waffle iron and a bowling ball.","Chuck Norris finished World of Warcraft.","Chuck Norris hosting is 101% uptime guaranteed.","If you try to kill -9 Chuck Norris's programs, it backfires.","Chuck Norris is the only human being to display the Heisenberg uncertainty principle - you can never know both exactly where and how quickly he will roundhouse-kick you in the face.","Love does not hurt. Chuck Norris does.","Police label anyone attacking Chuck Norris as a Code 45-11.... A suicide.","Project managers never ask Chuck Norris for estimations... ever.","Chuck Norris doesn't believe in Germany.","For Chuck Norris, NP-Hard = O(1).","Every SQL statement that Chuck Norris codes has an implicit &quot;COMMIT&quot; in its end.","Chuck Norris burst the dot com bubble.","The only sure things are Death and Taxes?and when Chuck Norris goes to work for the IRS, they'll be the same thing.","When Chuck Norris talks, everybody listens. And dies.","After taking a steroids test doctors informed Chuck Norris that he had tested positive. He laughed upon receiving this information, and said &quot;of course my urine tested positive, what do you think they make steroids from?&quot;","Jesus can walk on water, but Chuck Norris can walk on Jesus.","MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it.","All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds.","Chuck Norris doesn't need a debugger, he just stares down the bug until the code confesses.","Chuck Norris doesn't read books. He stares them down until he gets the information he wants.","How many Chuck Norris' does it take to change a light bulb? None, Chuck Norris prefers to kill in the dark.","Everything King Midas touches turnes to gold. Everything Chuck Norris touches turns up dead.","Noah was the only man notified before Chuck Norris relieved himself in the Atlantic Ocean.","Chuck Norris owns a chain of fast-food restaurants throughout the southwest. They serve nothing but barbecue-flavored ice cream and Hot Pockets.","The Chuck Norris Eclipse plugin made alien contact.","According to the Bible, God created the universe in six days. Before that, Chuck Norris created God by snapping his fingers.","A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.","There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue.","Chuck Norris wipes his ass with chain mail and sandpaper.","There are no steroids in baseball. Just players Chuck Norris has breathed on.","Chuck Norris qualified with a top speed of 324 mph at the Daytona 500, without a car.","Chuck Norris doesn't cheat death. He wins fair and square.","Chuck Norris has never been accused of murder because his roundhouse kicks are recognized as &quot;acts of God.&quot;","When Chuck Norris does division, there are no remainders.","If tapped, a Chuck Norris roundhouse kick could power the country of Australia for 44 minutes.","Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol.","Chuck Norris has never been in a fight, ever. Do you call one roundhouse kick to the face a fight?","Chuck Norris does not own a house. He walks into random houses and people move.","Chuck Norris can solve the Towers of Hanoi in one move.","Chuck Norris can access private methods.","When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.","Staring at Chuck Norris for extended periods of time without proper eye protection will cause blindess, and possibly foot sized brusies on the face.","As an infant, Chuck Norris' parents gave him a toy hammer. He gave the world Stonehenge.","Chuck Norris doesn't use GUI, he prefers COMMAND line.","Chuck Norris once sued Burger King after they refused to put razor wire in his Whopper Jr, insisting that that actually is &quot;his&quot; way.","Chuck Norris can lead a horse to water AND make it drink.","Chuck Norris can divide by zero.","Do you know why Baskin Robbins only has 31 flavors? Because Chuck Norris doesn't like Fudge Ripple.","Simply by pulling on both ends, Chuck Norris can stretch diamonds back into coal.","As President Roosevelt said: &quot;We have nothing to fear but fear itself. And Chuck Norris.&quot;","Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into a glacier.","Some people like to eat frogs' legs. Chuck Norris likes to eat lizard legs. Hence, snakes.","Chuck Norris can do a roundhouse kick faster than the speed of light. This means that if you turn on a light switch, you will be dead before the lightbulb turns on.","Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag.","Archeologists unearthed an old english dictionary dating back to the year 1236. It defined &quot;victim&quot; as &quot;one who has encountered Chuck Norris&quot;","When Chuck Norris plays Oregon Trail, his family does not die from cholera or dysentery, but rather, roundhouse kicks to the face. He also requires no wagon, since he carries the oxen, axels, and buffalo meat on his back. He always makes it to Oregon before you.","According to Einstein's theory of relativity, Chuck Norris can actually roundhouse kick you yesterday.","China lets Chuck Norris search for porn on Google.","One day Chuck Norris walked down the street with a massive erection. There were no survivors.","The First Law of Thermodynamics states that energy can neither be created nor destroyed... unless it meets Chuck Norris.","&quot;Sweating bullets&quot; is literally what happens when Chuck Norris gets too hot.","Since 1940, the year Chuck Norris was born, roundhouse-kick related deaths have increased 13,000 percent.","Scientifically speaking, it is impossible to charge Chuck Norris with &quot;obstruction of justice.&quot; This is because even Chuck Norris cannot be in two places at the same time.","A movie scene depicting Chuck Norris losing a fight with Bruce Lee was the product of history's most expensive visual effect. When adjusted for inflation, the effect cost more than the Gross National Product of Paraguay.","When God said, &quot;let there be light&quot;, Chuck Norris said, &quot;say 'please'.&quot;","There is no theory of evolution, just a list of creatures Chuck Norris allows to live.","Chuck Norris breaks RSA 128-bit encrypted codes in milliseconds.","Chuck Norris's programs can pass the Turing Test by staring at the interrogator.","When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket.","Science Fact: Roundhouse kicks are comprised primarily of an element called Chucktanium.","Human cloning is outlawed because of Chuck Norris, because then it would be possible for a Chuck Norris roundhouse kick to meet another Chuck Norris roundhouse kick. Physicists theorize that this contact would end the universe.","Chuck Norris doesn't have disk latency because the hard drive knows to hurry the hell up.","Chuck Norris knows the last digit of pi.","Chuck Norris does, in fact, live in a round house.","It is believed dinosaurs are extinct due to a giant meteor. That's true if you want to call Chuck Norris a giant meteor.","# Chuck Norris's show is called Walker: Texas Ranger, because Chuck Norris doesn't run.","Chuck Norris can instantiate an abstract class.","Diamonds are not, despite popular belief, carbon. They are, in fact, Chuck Norris fecal matter. This was proven a recently, when scientific analysis revealed what appeared to be Jean-Claude Van Damme bone fragments inside the Hope Diamond.","Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on.","Not everyone that Chuck Norris is mad at gets killed. Some get away. They are called astronauts.","A diff between your code and Chuck Norris's is infinite.","Paper beats rock, rock beats scissors, and scissors beats paper, but Chuck Norris beats all 3 at the same time.","An anagram for Walker Texas Ranger is KARATE WRANGLER SEX. I don't know what that is, but it sounds AWESOME.","Chuck Norris roundhouse kicks don't really kill people. They wipe out their entire existence from the space-time continuum.","Chuck Norris could use anything in java.util.* to kill you, including the javadocs.","CNN was originally created as the &quot;Chuck Norris Network&quot; to update Americans with on-the-spot ass kicking in real-time.","In the movie &quot;The Matrix&quot;, Chuck Norris is the Matrix. If you pay close attention in the green &quot;falling code&quot; scenes, you can make out the faint texture of his beard."]