["According to Einstein's theory of relativity, Chuck Norris can actually roundhouse kick you yesterday.","Chuck Norris began selling the Total Gym as an ill-fated attempt to make his day-to-day opponents less laughably pathetic.","Chuck Norris has banned rainbows from the state of North Dakota.","It takes Chuck Norris 20 minutes to watch 60 Minutes.","Chuck Norris plays racquetball with a waffle iron and a bowling ball.","182,000 Americans die from Chuck Norris-related accidents every year.","Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe.","Chuck Norris' testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy.","Chuck Norris is the only person to ever win a staring contest against Ray Charles and Stevie Wonder.","Chuck Norris can write infinite recursion functions and have them return.","In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research.","Chuck Norris has 12 moons. One of those moons is the Earth.","It takes 14 puppeteers to make Chuck Norris smile, but only 2 to make him destroy an orphanage.","Scotty in Star Trek often says &quot;Ye cannae change the laws of physics.&quot; This is untrue. Chuck Norris can change the laws of physics. With his fists.","Chuck Norris can blow bubbles with beef jerky.","Ninjas want to grow up to be just like Chuck Norris. But usually they grow up just to be killed by Chuck Norris.","It's widely believed that Jesus was Chuck Norris' stunt double for crucifixion due to the fact that it is impossible for nails to pierce Chuck Norris' skin.","Chuck Norris won super bowls VII and VIII singlehandedly before unexpectedly retiring to pursue a career in ass-kicking.","Chuck Norris doesn't wash his clothes. He disembowels them.","Chuck Norris doesn't believe in Germany.","Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.","No statement can catch the ChuckNorrisException.","Chuck Norris does not code in cycles, he codes in strikes.","Chuck Norris has a deep and abiding respect for human life... unless it gets in his way.","Jesus can walk on water, but Chuck Norris can swim through land.","Staring at Chuck Norris for extended periods of time without proper eye protection will cause blindess, and possibly foot sized brusies on the face.","Along with his black belt, Chuck Norris often chooses to wear brown shoes. No one has DARED call him on it. Ever.","Some people ask for a Kleenex when they sneeze, Chuck Norris asks for a body bag.","As an infant, Chuck Norris' parents gave him a toy hammer. He gave the world Stonehenge.","Chuck Norris's OSI network model has only one layer - Physical.","Chuck Norris does, in fact, live in a round house.","Chuck Norris can install a 64 bit OS on 32 bit machines.","The Chuck Norris military unit was not used in the game Civilization 4, because a single Chuck Norris could defeat the entire combined nations of the world in one turn.","The Bible was originally titled &quot;Chuck Norris and Friends&quot;","When in a bar, you can order a drink called a &quot;Chuck Norris&quot;. It is also known as a &quot;Bloody Mary&quot;, if your name happens to be Mary.","Chuck Norris built a time machine and went back in time to stop the JFK assassination. As Oswald shot, Chuck met all three bullets with his beard, deflecting them. JFK's head exploded out of sheer amazement.","Chuck Norris? sperm is so badass, he had sex with Nicole Kidman, and 7 months later she prematurely gave birth to a Ford Excursion.","Every time someone uses the word &quot;intense&quot;, Chuck Norris always replies &quot;you know what else is intense?&quot; followed by a roundhouse kick to the face.","Chuck Norris once sued Burger King after they refused to put razor wire in his Whopper Jr, insisting that that actually is &quot;his&quot; way.","When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part.","Chuck Norris once rode a bull, and nine months later it had a calf.","All browsers support the hex definitions #chuck and #norris for the colors black and blue.","If you work in an office with Chuck Norris, don't ask him for his three-hole-punch.","Chuck Norris is not Politically Correct. He is just Correct. Always.","Who let the dogs out? Chuck Norris let the dogs out... and then roundhouse kicked them through an Oldsmobile.","70% of a human's weight is water. 70% of Chuck Norris' weight is his dick.","Kryptonite has been found to contain trace elements of Chuck Norris roundhouse kicks to the face. This is why it is so deadly to Superman.","When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.","Maslow's theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill.","There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up.","Chuck Norris drinks napalm to quell his heartburn.","CNN was originally created as the &quot;Chuck Norris Network&quot; to update Americans with on-the-spot ass kicking in real-time.","Chuck Norris has never been accused of murder because his roundhouse kicks are recognized as &quot;acts of God.&quot;","Chuck Norris did in fact, build Rome in a day.","MySpace actually isn't your space, it's Chuck's (he just lets you use it).","Chuck Norris is the only known mammal in history to have an opposable thumb. On his penis.","Project managers never ask Chuck Norris for estimations... ever.","The pie scene in &quot;American Pie&quot; is based on a dare Chuck Norris took when he was younger. However, in Chuck Norris' case, the &quot;pie&quot; was the molten crater of an active volcano.","If Chuck Norris wants your opinion, he'll beat it into you.","Chuck Norris's keyboard has the Any key.","There are only two things that can cut diamonds: other diamonds, and Chuck Norris.","Science Fact: Roundhouse kicks are comprised primarily of an element called Chucktanium.","Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol.","Chuck Norris can speak Braille.","Product Owners never argue with Chuck Norris after he demonstrates the DropKick feature.","Chuck Norris once round-house kicked a salesman. Over the phone.","There are two types of people in the world... people that suck, and Chuck Norris.","In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer.","In the medical community, death is referred to as &quot;Chuck Norris Disease&quot;","Chuck Norris once pulled out a single hair from his beard and skewered three men through the heart with it.","Chuck Norris doesn't bowl strikes, he just knocks down one pin and the other nine faint.","Chuck Norris owns a chain of fast-food restaurants throughout the southwest. They serve nothing but barbecue-flavored ice cream and Hot Pockets.","When God said, &quot;let there be light&quot;, Chuck Norris said, &quot;say 'please'.&quot;","Chuck Norris had to stop washing his clothes in the ocean. The tsunamis were killing people.","Aliens DO indeed exist. They just know better than to visit a planet that Chuck Norris is on.","As President Roosevelt said: &quot;We have nothing to fear but fear itself. And Chuck Norris.&quot;","The chemical formula for the highly toxic cyanide ion is CN-. These are also Chuck Norris' initials. This is not a coincidence.","Chuck Norris doesn't use GUI, he prefers COMMAND line.","Chuck Norris crossed the road. No one has ever dared question his motives.","Jean-Claude Van Damme once kicked Chuck Norris' ass. He was then awakened from his dream by a roundhouse kick to the face.","Chuck Norris doesnt wear a watch, HE decides what time it is.","Scientists have estimated that the energy given off during the Big Bang is roughly equal to 1CNRhK (Chuck Norris Roundhouse Kick).","The easiest way to determine Chuck Norris' age is to cut him in half and count the rings.","A man once asked Chuck Norris if his real name is &quot;Charles&quot;. Chuck Norris did not respond, he simply stared at him until he exploded.","Bill Gates thinks he's Chuck Norris. Chuck Norris actually laughed. Once.","It is scientifically impossible for Chuck Norris to have had a mortal father. The most popular theory is that he went back in time and fathered himself.","Most people fear the Reaper. Chuck Norris considers him &quot;a promising Rookie&quot;.","Chuck Norris shot the sheriff, but he round house kicked the deputy.","Chuck Norris can taste lies.","Chuck Norris has two speeds: Walk and Kill.","The phrase 'break a leg' was originally coined by Chuck Norris's co-stars in Walker, Texas Ranger as a good luck charm, indicating that a broken leg might be the worst extent of their injuries. This never proved to be the case.","When Arnold says &quot;I'll be back&quot; in Terminator movie it is implied that he's going to ask Chuck Norris for help."]